---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor
source: html/df3a8291-cafa-085e-037e-0bbb9aad1109.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorEntry.#ctor Method

Constructs a new AnalysisDisplayColorEntry with default settings.

## Syntax (C#)
```csharp
public AnalysisDisplayColorEntry()
```